W4D5/W4D4_classwork/music_app/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands"
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def new
    @bands = Band.all
    @band = Band.find(params[:band_id])

INSERT INTO "albums" ("band_id", "title", "year") VALUES ($1, $2, $3) RETURNING "id"  [["band_id", 5], ["title", "DEath OWNS"], ["year", "2000"]]
---
  def create
    @album = Album.new(album_params)
    if @album.save

SELECT "bands".* FROM "bands"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @bands = Band.all
    @album = Album.find_by(id: params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "albums" SET "band_id" = $1 WHERE "albums"."id" = $2  [["band_id", 4], ["id", 7]]
---
  def update
    @album= Album.find_by(id: params[:id])
    if @album.update(album_params)