W4D5/W4D4_classwork/music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Bobby Shmurda II"], ["updated_at", "2018-08-16 21:08:35.216595"], ["id", 4]]
---
  def update
    @band = Band.find_by(id: params[:id])
    if @band.update(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 4]]
---
  def destroy
    @band = Band.find_by(id: params[:id])
    @band.destroy