W4D5/W4D4_classwork/music_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "session_token", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["email", "bobby"], ["session_token", "n1BFtNalBzGNmtDnAVqmQg"], ["password_digest", "$2a$10$gBY95x/SdJAfnehJmpX.HulE.ytwSftZsuJnYvuNj8S3r3spMdg3W"]]