W4D5/W4D4_classwork/music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = generate_session_token
    self.save
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "L70Fq88PTskzh7Mu7U7Ytw"], ["id", 9]]